export default {
  'load-error' : 'Помилка завантаження',
  'wrong-credentials': 'Неправильний логін або пароль, будь ласка, перевірте правильність введених даних',
  'email': 'Перевірте правильність введеного імейлу',
  'required': "Це поле є обов'язковим для заповнення",
  'password-error': 'Пароль повинен складатися не менше ніж з 8 символів',
  'same-password': 'Бідь-ласка повторіть пароль',
  'type-number': 'Поле повинно бути числом',
  'invalid-phone': 'Перевірте правельність введеного телефону',
  'invalid-name': 'Невалідне значення, введіть слово або 2 слова через тіре!',
  'min5': 'Мінімальне значення - 5',
  'min8': 'Мінімальне значення - 8',
  'min30': 'Мінімальне значення - 30',
  'min145': 'Мінімальне значення - 145',
  'max250': 'Максимальне значення - 250',
  'no-results': 'Ми не знайшли жодного співпадіння із вашим запитом'
}