export default {
  'load-error' : 'Помилка завантаження',
  'check-network' : 'Перевірте, будь ласка, стабільність інтернет з’єднання та спробуйте ще раз',
  'app-name' : 'Blanball',
  'authorization': 'Авторизація у системі',
  'forgot-password': 'Я не пам’ятаю пароль',
  'remember-login': 'Запам’ятати логін та пароль для автоматичного входу',
  'remember-me': 'Запам’ятати логін та пароль для автоматичного входу',
  'remember-me-short': 'Запам’ятати мене',
  'wrong-credentials': 'Неправильний логін або пароль, будь ласка, перевірте правильність введених даних',
  'no-account': 'Ще не маєте акаунту?',
  'register': 'Зареєструватися',
  'load-app': 'Завантажте додаток BlanBall на свій смартфон та будьте завжди на зв’язку',
  'check-email': 'Перевірте правильність введеного імейлу',
  'required': "Це поле є обов'язковим для заповнення",
  'password-error': 'Пароль повинен складатися не менше ніж з 8 символів'
}