export default {
  change_number: {
    'title': 'Зміна номера телефону',
    'main-text': 'Тут Ви можете змінити номер телефону. Ваш акаунт і всі наявні дані будут перенесені на новий номер без втрати поточних налаштувань та інформації.',
    'leave-email': 'Залишити поточний номер',
    'change-number-title': 'Змінити номер',
    'current-number': 'Поточний номер',
    'new-number': 'Новий номер',
    'sms-code': 'SMS із кодом підтвердження прийде протягом 30 сек'
  },
  change_login: {
    'title': 'Зміна логіну облікового запису',
    'current-email': 'Поточний E-mail',
    'new-email': 'Новий E-mail'
  },
  delete_acc: {
    'title': 'Видалення акаунту',
    'title-second': 'Підтвердіть свій намір видалити акаунт',
    'text': 'Ви збираєтеся видалити свій обліковий запис. Усі ваші дані, налаштування та історія активностей буде видалена',
    'text-second': 'Лист із кодом підтвердження прийде за адресою',
    'during': 'протягом',
    'seconds': 'сек'
  },
  change_password: {
    'title': 'Зміна паролю',
    'current-pass': 'Ваш поточний пароль',
    'new-pass': 'Придумайте новий пароль',
    'sms-code': 'Лист із кодом підтвердження прийде за адресою',
    'during': 'протягом',
    'seconds': 'сек',
    'sms-not-came': 'Не прийшов лист з кодом підтвердження?',
    'send-again': 'Надіслати повторно'
  },
  change_user_data: {
    'main-text': 'Бажаєте подивитись як виглядатиме ваш профіль для інших користувачів?',
    'cancel-changes': 'Скасувати зміни'
  }
}