export default {
  change_login: {
    title: 'Зміна логіну облікового запису',
    'current-email': 'Поточний E-mail',
    'new-email': 'Новий E-mail',
    email: 'E-mail',
    'code-message': 'Лист із кодом підтвердження прийде за адресою',
    'email-already-used': 'Цей імейл вже зайнятий',
  },
  delete_acc: {
    title: 'Видалення акаунту',
    'title-second': 'Підтвердіть свій намір видалити акаунт',
    text: 'Ви збираєтеся видалити свій обліковий запис. Усі ваші дані, налаштування та історія активностей буде видалена',
    'text-second': 'Лист із кодом підтвердження прийде за адресою',
    during: 'протягом',
    seconds: 'сек',
  },
  change_password: {
    title: 'Зміна паролю',
    'current-pass': 'Ваш поточний пароль',
    'new-pass': 'Придумайте новий пароль',
    'sms-code': 'Лист із кодом підтвердження прийде за адресою',
    'wrong-old-pass': 'Ви ввели неправильний старий пароль',
    'server-error': 'Проблема на серверi',
    'bad-verify-code': 'Перевірте правильність введеного коду підтвердження',
  },
  change_user_data: {
    'main-text':
      'Бажаєте подивитись як виглядатиме ваш профіль для інших користувачів?',
    'cancel-changes': 'Скасувати зміни',
  },
  share_event: {
    title: 'Поділитися',
    'input-text': 'Посилання на подію',
  },
  edit_avatar: {
    'another-pic': 'Інше фото',
    rotate: 'Перевернути',
    cut: 'Обрізати',
    'chose-another-pic': 'Обрати інше фото',
  },
  verify_email: {
    title: 'Пiдтвердити поштову адресу',
  },
  event_feedback: {
    'your-comment': 'Ваш коментар',
  },
  bug_report: {
    title: 'Повідомити про промилку на сайті',
    'input-placeholder': 'Не вдається долучитися до події',
    'input-title': 'Із чим пов`язана помилка?',
    'text-area-title': 'Коли та де ви зіштовхнулися із помилкою?',
  },
  remove_invited_users: {
    title: 'Видалення запрошених користувачів',
    'main-text':
      'Ви дійсно бажаєте видалити всіх запрошених вами користувачів на цю подію?',
  },
  event_created: {
    title: 'Чудово!',
    'main-text':
      'Подія успішно опублікована та доступна для інших користувачів',
  },
  event_updated: {
    title: 'Збережено',
    'main-text': 'Інформацію успішно відредаговано та застосовано',
  },
  delete_events: {
    title: 'Видалення подій',
    'main-text': 'Ви впевнені, що хочете видалити {length} подій?',
    'button-1-text': 'Ні, не видаляти',
    'button-2-text': 'Так, видалити',
  },
  no_perm_to_edit: {
    title: 'Редагування недоступне',
    'main-text':
      'Ви не можете редагувати подію, яка вже почалася або закінчилася',
  },
  no_perm_to_hide_events: {
    title: 'Приховування недоступне',
    'main-text':
      'На поточний момент у вас немає жодної події яку б ви могли приховати"',
  },
  selectFormsColors: {
    title: 'Призначення форм командам',
    'main-text': 'Оберіть кольори форм або маніжок для команд',
    'form-type': 'Вид форми',
  },
  invite_user_to_event: {
    title: 'Запрошення до участі у події',
    'main-text': 'Ви збираєтеся запросити',
    message: 'Повідомлення',
  },
  no_perm_to_pin: {
    title: 'Закріплення не доступне',
    'main-text': 'Ви досягли ліміту 5 за кількістю закріплених подій',
  },
  invite_users_to_event: {
    title: 'Запрошення учасників',
    invited: 'Запрошені',
    plus_users: '+ {count} користувачів'
  },
  cancel_invite_users: {
    title: 'Скасувати запрошення',
    'main-text': 'Ви обрали {count} учасників. Бажаєте скасувати запрошення цих людей?',
    'button-1-text': 'Ні, не скасовувати',
    'button-2-text': 'Так, скасувати',
  }
};
