export default {
    noEvents: {
        title: 'Наразі немає актуальних подій для відображення',
        description: 'Ваша подія може стати першою',
        button_text: 'Організувати подію!',
    },
    noEventPlayers: {
        title: 'Наразі, немає учасників для відображення',
        description_author: 'Як тільки хтось із користувачів приєднається — ми сповістимо вас',
        button_text: 'Організувати подію!',
        description_user: 'Покищо ніхто не долучився до участі у події, однак, ви можете стати першим!'
    },
    noEventFans: {
        title: 'Наразі, немає глядачів для відображення',
        description_author: 'Як тільки хтось із глядачів приєднається — ми сповістимо вас',
        button_text: 'Організувати подію!',
        description_user: 'Покищо ніхто не долучився до вболівання у події, однак, ви можете стати першим!'
    },
    noMyEvents: {
        title: 'До сьогодні ви ще не були організатором подій',
        description: 'Організуйте вашу першу подію',
        button_text: 'Створити подію',
    }
}