export default {
  'email-verified': 'Пошта успiшно верiфiкована',
  'email-changed': 'Вашу пошту успішно змінено',
  'some-mistake': 'Операцiя невдачна',
  'account-deleted':
    'Ваш обліковий запис було успішно видалено. Повертайтеся якнайшвидше :)',
  'password-reset': 'Вітаємо! Новий пароль успішно збережено та застосовано',
  'bug-report-created':
    'Дякуємо, що допомагаєте робити BlanBall краще! Ваше повідомлення буде розглянуте розробниками',
  'file-bad-format':
    'Файл `{name}` не був завантажений, він не має валідного формату',
  'file-max-size':
    'Файл `{name}` не був завантажений, його розмір перевищує 1 мегабайт',
  'event-share-link-copied': 'Посилання на цю подію було успішно скопійовано',
  'events-deleted':
    'Ваші події були успішно видалені! Всі учасники подій були повідомлені',
  'events-pinned': 'Ваші події були успішно закріплені зверху списку',
  'events-unpinned': 'Ваші події були успішно відкріплені',
  'event-request-sent':
    'Вашу заявку на участь у події було успішно надіслано автору на розгляд',
  'event-join-as-player': 'Ви успішно долучились до участі у події, як гравець',
  'event-join-as-fan': 'Ви успішно долучились до участі у події, як глядач',
  'event-leave': 'Ви скасували свою участь у події',
  'email-copied': 'Електронна адреса успішно скопійована в буфер обміну',
  'phone-copied': 'Номер телефону успішно скопійовано в буфер обміну',
  'sent-invites': 'Запрошення успішно розіслані',
};
