export default {
  'email-verified': 'Пошта успiшно верiфiкована',
  'some-mistake': 'Операцiя невдачна',
  'password-reset': 'Вітаємо! Новий пароль успішно збережено та застосовано',
  'bug-report-created':'Дякуємо, що допомагаєте робити BlanBall краще! Ваше повідомлення буде розглянуте розробниками',
  'file-bad-format': 'Файл `{name}` не був завантажений, він не має валідного формату',
  'file-max-size': 'Файл `{name}` не був завантажений, його розмір перевищує 1 мегабайт',
  'event-share-link-copied': 'Посилання на цю подію було успішно скопійовано',
  'events-deleted': 'Ваші події були успішно видалені! Всі учасники подій були повідомлені',
}
