export default {
  'renew-access': 'Відновлення доступу',
  'letter-code': 'Лист із кодом-підтвердження надійде на вказану адресу, введіть його у відведене поле',
  'phone-email': 'Телефон або пошта',
  'message-30sec': 'Повідомлення прийде протягом 30 сек',
  'cancel': 'Скасувати',
  'drop-password': 'Скинути пароль',
  'new-password': 'Придумайте новий надійний пароль. Зміни вступлять у силу одразу після збереження',
  'enter-new-password': 'Новий пароль',
  'repeat-new-password': 'Повторіть пароль',
  'save-changes': 'Зберегти зміни',
  'load-app': 'Завантажте додаток BlanBall на свій смартфон та будьте завжди на зв’язку',
  'post': 'Пошта'
}