export default {
  'renew-access': 'Відновлення доступу',
  'letter-code': 'Лист із кодом-підтвердження надійде на вказану адресу',
  'phone-email': 'Телефон або пошта',
  'message-30sec': 'Повідомлення прийде на',
  cancel: 'Скасувати',
  'drop-password': 'Скинути пароль',
  'write-code': 'Введіть код-підтвердження у відведене поле',
  'new-password':
    'Придумайте новий надійний пароль. Зміни вступлять у силу одразу після збереження',
  'enter-new-password': 'Новий пароль',
  'repeat-new-password': 'Повторіть пароль',
  'save-changes': 'Зберегти зміни',
  'send-code': 'Надіслати код',
  'load-app':
    'Завантажте додаток BlanBall на свій смартфон та будьте завжди на зв’язку',
  post: 'Пошта',
};
