<template>
  <PolicyWrapper :contentItems="contentItems">
    <template #title>Політика щодо файлів cookie</template>
    <template #content>
    <p>      Ця політика щодо використання файлів cookies (“Політика”) описує, що таке
      файли cookies та як вони використовуються на сайті (“Веб-сайт”) та
      будь-яких пов'язаних з ним продуктах та послугах (спільно, “Послуги”) на
      сайті <a href="https://client.blanball.com">client.blanball.com</a>. Ця
      Політика є правово обов'язковою угодою між вами (“Користувач”, “ви” або
      “ваш”) та FlumX (“FlumX”, “ми”, “нас” або “наш”). Якщо ви укладаєте цю
      угоду від імені бізнесу або іншої юридичної особи, ви підтверджуєте, що
      маєте повноваження зв'язувати таку юридичну особу цією угодою, у такому
      випадку терміни “Користувач”, “ви” або “ваш” відносяться до такої
      юридичної особи. Якщо ви не маєте таких повноважень або не згодні з
      умовами цієї угоди, ви не повинні приймати цю угоду і не можете
      користуватися Послугами на сайті. Ви повинні прочитати цю Політику, щоб
      зрозуміти типи файлів cookies, які ми використовуємо, інформацію, яку ми
      збираємо за допомогою файлів cookies та як використовуємо цю інформацію.
      Вона також описує варіанти, які вам доступні щодо прийняття або відхилення
      використання файлів cookies. Для отримання додаткової інформації про те,
      як ми використовуємо, зберігаємо та забезпечуємо безпеку вашої особистої 
      інформації, див. нашу <a :href="privacyPolicyUrl">політику конфіденційності</a
      >.</p>
      <h2 id="what-are-cookies">Що таке cookies?</h2>
      <p>
        Файли cookie - це невеликі шматочки даних, які зберігаються у текстових
        файлах та зберігаються на вашому комп'ютері або інших пристроях під час
        завантаження веб-сторінок у браузері. Вони широко використовуються для
        запам'ятовування вас та ваших налаштувань, як для одноразового візиту
        (за допомогою "сесійних файлів cookie") так і для багаторазових
        відвідувань (за допомогою "стійких файлів cookie").
      </p>
      <p>
        Сесійні файли cookie є тимчасовими файлами cookie, які використовуються
        протягом вашого візиту на веб-сайті та автоматично видаляються при
        закритті веб-браузера.
      </p>
      <p>
        Стійкі файли cookie використовуються для запам'ятовування ваших
        налаштувань на нашому веб-сайті та залишаються на вашому настільному
        комп'ютері або мобільному пристрої, навіть після закриття браузера чи
        перезапуску комп'ютера. Вони забезпечують стабільний та ефективний
        досвід для вас під час відвідування веб-сайту та користування послугами.
      </p>
      <p>
        Файли cookies можуть бути встановлені веб-сайтом (“перші файли cookies”)
        або третіми сторонами, такими як ті, які надають контент або рекламні
        або аналітичні послуги на веб-сайті (“файли cookies третіх сторін”). Ці
        треті сторони можуть впізнавати вас, коли ви відвідуєте наш веб-сайт, а
        також коли ви відвідуєте певні інші веб-сайти.
      </p>
      <h2 id="what-type-of-cookies-do-we-use">
        Які типи файлів cookie ми використовуємо?
      </h2>
      <p>
        Ми не використовуємо файли cookies для відстеження вашого використання
        інтернету або веб-сайту, для збору або зберігання ваших персональних
        даних або з інших причин. Однак, будь ласка, зверніть увагу, що в деяких
        країнах дані, такі як ідентифікатори cookies, вважаються персональною
        інформацією. У випадку обробки таких даних, що вважаються персональною
        інформацією, ми будемо обробляти ці дані відповідно до наших політик
        конфіденційності та cookies.
      </p>
      <h2 id="changes-and-amendments">Зміни та поправки</h2>
      <p>
        Ми залишаємо за собою право в будь-який момент нашої усвідомленої волі
        змінювати цю політику та її умови, що стосуються веб-сайту та послуг.
        При внесенні змін ми зазначимо дату оновлення внизу цієї сторінки. Також
        ми можемо повідомляти вас про зміни іншими способами, на наш розсуд,
        наприклад, через контактні дані, які ви надали.
      </p>
      <p>
        Оновлена версія цієї політики набуває чинності негайно після публікації
        переглянутої політики, якщо інше не вказано. Ваша подальша взаємодія з
        веб-сайтом та послугами після дати вступу в силу переглянутої політики
        (або будь-якої іншої вказаної дії) свідчить про вашу згоду з внесеними
        змінами.
      </p>
      <h2 id="acceptance-of-this-policy">Прийняття цієї політики</h2>
      <p>
        Ви підтверджуєте, що прочитали цю політику та погоджуєтеся з усіма її
        умовами та положеннями. Звернення до веб-сайту та послуг означає згоду з
        цією політикою. Якщо ви не згодні дотримуватися умов цієї політики, ви
        не маєте дозволу звертатися до веб-сайту та послуг або користуватися
        ними.
      </p>
      <h2 id="contacting-us">Зв'язок з нами</h2>
      <p>
        Якщо у вас є будь-які запитання, скарги або зауваження щодо цієї
        політики або використання файлів cookie, ми радимо зв'язатися з нами за
        допомогою нижченаведених контактних даних:
      </p>
      <p>
        <a
          href="&#109;&#097;&#105;&#108;&#116;&#111;&#058;&#98;&#108;&#97;nba&#108;&#108;.&#99;&#108;ie&#110;t&#64;&#105;t-&#102;l&#117;&#109;x&#46;&#99;&#111;&#109;"
          >&#98;la&#110;&#98;a&#108;l.c&#108;&#105;ent&#64;i&#116;&#45;flum&#120;.&#99;&#111;&#109;</a
        >
      </p>
      <p>Цей документ був оновлений в 13 квітня 2023 року.</p>
    </template>
  </PolicyWrapper>
</template>

<script>
import { computed } from 'vue';

import PolicyWrapper from '@mainComponents/policy/PolicyWrapper.vue';

import { ROUTES } from '@routes/router.const';
import { CONSTS } from '@consts'

export default {
  components: {
    PolicyWrapper,
  },
  setup() {
    const contentItems = computed(() => {
      return CONSTS.policy.COOKIE_POLICY_ITEMS
    })

    const privacyPolicyUrl = computed(() => {
      return `https://client.blanball.com${ROUTES.PRIVACY_POLICY.absolute}`;
    });

    return {
      contentItems,
      privacyPolicyUrl,
    };
  },
};
</script>

<style lang="scss" scoped>
@import '@sytles/policy.scss';
</style>
