<template>
  <PolicyWrapper :contentItems="contentItems">
    <template #title>Відмова від відповідальності</template>
    <template #content>
      <p>
        Ця відмовна заява (“Відмовна заява”) встановлює загальні положення,
        відкриття та умови використання вами веб-сайту
        <a href="https://client.blanball.com">client.blanball.com</a>
        (“Веб-сайт” або “Сервіс”) та будь-яких з них пов'язаних продуктів та
        послуг (загалом, “Послуги”). Ця Відмовна заява є правовим договором між
        вами (“Користувач”, “ви” або “ваш”) та FlumX (“FlumX”, “ми”, “нас” або
        “наш”). Якщо ви укладаєте цей договір від імені бізнесу або іншої
        юридичної особи, ви підтверджуєте, що маєте повноваження зв'язати таку
        юридичну особу з цим договором, у такому випадку терміни "Користувач",
        "ви" або "ваш" будуть посилатися на таку юридичну особу. Якщо у вас
        немає таких повноважень або ви не згодні з умовами цього договору, ви не
        повинні приймати цей договір, та не можете отримувати доступ та
        використовувати Веб-сайт та Послуги. Заходячи на Веб-сайт та
        використовуючи Послуги, ви визнаєте, що ви прочитали, зрозуміли і згодні
        бути пов'язаним умовами цієї Відмовної заяви. Ви визнаєте, що ця
        Відмовна заява є договором між вами та FlumX, хоча вона електронна і не
        підписана фізично вами, і вона регулює ваше використання Веб-сайту та
        Послуг.
      </p>
      <h2 id="representation">Представництво</h2>
      <p>
        Будь-які погляди чи думки, що представлені на веб-сайті, належать
        виключно творцям вмісту і не відображають поглядів людей, установ чи
        організацій, з якими FlumX чи творці можуть або не можуть пов'язуватися
        у професійному чи особистому аспекті, якщо це явно не зазначено.
        Будь-які погляди чи думки не мають на меті ображати будь-яку релігію,
        етнічну групу, клуб, організацію, компанію чи індивіда.
      </p>
      <h2 id="content-and-postings">Вміст та публікації</h2>
      <p>
        Ви можете друкувати або копіювати будь-яку частину Веб-сайту та Послуг
        для особистого або некомерційного використання.
      </p>
      <p>
        Ви можете подавати новий контент та коментувати існуючий контент на
        Веб-сайті. Ви не можете видаавати себе за когось іншу особу на Веб-сайті
        та через Сервіси. Ви не можете публікувати контент, який є докорінно
        неправдивим, шахрайським, непристойним, загрожує приватним правам іншої
        особи або є інакше незаконним. Ви не можете публікувати контент, який
        порушує права на інтелектуальну власність будь-якої іншої особи або
        організації. Ви не можете публікувати контент, який містить будь-який
        комп'ютерний вірус або інший код, призначений для розриву, шкоди або
        обмеження функціонування будь-якого комп'ютерного програмного
        забезпечення або апаратного забезпечення.
      </p>
      <h2 id="reviews-and-testimonials">Відгуки та рекомендації</h2>
      <p>
        Відгуки надходять у різних формах за допомогою різних методів подачі.
        Відгуки не обов'язково є представниками всіх користувачів, які будуть
        використовувати Веб-сайт та послуги, і FlumX не несе відповідальності за
        думки або коментарі, доступні на Веб-сайті, і не обов'язково поділяє їх.
        Усі висловлені думки строго є поглядами рецензентів.
      </p>
      <p>
        Відгуки відображаються без змін, за винятком корекції граматичних або
        орфографічних помилок. Деякі відгуки можуть бути відредаговані для
        більшої зрозумілості, або скорочені в тих випадках, коли оригінальний
        відгук містить зайву інформацію, яка не має значення для загальної
        громадськості. Відгуки можуть бути перевірені на автентичність, перш ніж
        вони стануть доступними для публічного перегляду.
      </p>
      <h2 id="indemnification-and-warranties">Компенсація та гарантії</h2>
      <p>
        Хоча ми зробили все можливе, щоб забезпечити правильність інформації, що
        міститься на Веб-сайті, FlumX не несе відповідальності за будь-які
        помилки або упущення, або за результати, отримані в результаті
        використання цієї інформації. Вся інформація на Веб-сайті надається "як
        є", без будь-яких гарантій повноти, точності, своєчасності або
        результатів, отриманих в результаті використання цієї інформації, і без
        будь-яких гарантій будь-якого виду, як прямих, так і побічних. У жодному
        разі FlumX, його партнери, працівники або агенти не будуть нести
        відповідальності перед Вами або будь-хто інший за будь-яке прийняте
        рішення або дію, здійснену залежно від інформації на Веб-сайті, або за
        будь-які наслідки, спеціальні чи подібні збитки, навіть якщо вас
        попереджено про можливість таких збитків.
      </p>
      <h2 id="changes-and-amendments">Зміни та поправки</h2>
      <p>
        Ми залишаємо за собою право змінювати цю Відмову від відповідальності
        або її умови, що стосуються Веб-сайту та Послуг, в будь-який час на наш
        розсуд. Коли ми це робимо, ми відредагуємо дату оновлення внизу цієї
        сторінки. Ми також можемо повідомляти вас про це іншими способами за
        нашим розсудом, такими як через контактну інформацію, яку ви надали.
      </p>
      <p>
        Оновлена версія відмови буде негайно дійсна після публікації
        переглянутої відмови, якщо не вказано інше. Ваша подальша використання
        Веб-сайту та Послуг після дії набуття чинності переглянутої відмови (або
        іншої такої дії, вказаної на той час) буде означати Вашу згоду на ці
        зміни.
      </p>
      <h2 id="acceptance-of-this-disclaimer">Прийняття цієї відмови</h2>
      <p>
        Ви підтверджуєте, що прочитали цю відмову від відповідальності та
        погоджуєтеся з усіма її умовами та положеннями. Звертаючись до Веб-сайту
        та користуючись послугами, ви погоджуєтеся дотримуватися цієї відмови
        від відповідальності. Якщо ви не згодні дотримуватися умов цієї відмови
        від відповідальності, вам не дозволяється отримувати доступ до Веб-сайту
        та користуватися послугами.
      </p>
      <h2 id="contacting-us">Зв'язок з нами</h2>
      <p>
        Якщо у вас є питання, турботи або скарги щодо цієї Угоди про відмову від
        відповідальності, ми радимо зв'язатися з нами за допомогою
        нижченаведених даних:
      </p>
      <p>
        <a
          href="&#109;&#097;&#105;&#108;&#116;&#111;&#058;&#98;la&#110;&#98;a&#108;l&#46;clien&#116;&#64;&#105;t&#45;f&#108;um&#120;&#46;&#99;o&#109;"
          >&#98;&#108;a&#110;&#98;all&#46;cl&#105;ent&#64;it-&#102;&#108;&#117;&#109;&#120;.&#99;&#111;m</a
        >
      </p>
      <p>Цей документ був оновлений останній раз 13 квітня 2023 року.</p>
    </template>
  </PolicyWrapper>
</template>

<script>
import PolicyWrapper from '@mainComponents/policy/PolicyWrapper.vue';

export default {
  components: {
    PolicyWrapper,
  },
  setup() {
    const contentItems = computed(() => {
      return CONSTS.policy.DISCLAMER_ITEMS;
    });

    return {
      contentItems,
    };
  },
};
</script>

<style lang="scss" scoped>
@import '@sytles/policy.scss';
</style>
