<template>
  <PolicyWrapper :contentItems="contentItems">
    <template #title>Політика конфіденційності</template>
    <template #content>
      <p>
        Ми поважаємо Вашу приватність і зобов'язуємось захищати її у
        відповідності з нашою політикою конфіденційності ("Політика"). Ця
        Політика описує типи інформації, яку ми можемо отримувати від Вас або
        яку Ви можете надавати («Особиста інформація») на веб-сайті
        <a href="https://client.blanball.com">client.blanball.com</a>
        ("Веб-сайт" або "Сервіс") та на будь-яких з його пов'язаних продуктів та
        послуг (у загальному - "Послуги"), а також наші практики збору,
        використання, зберігання, захисту та розкриття цієї Особистої
        інформації. Також описані варіанти, доступні Вам щодо використання Вашої
        Особистої інформації, а також те, як Ви можете отримати до неї доступ та
        оновити її.
      </p>
      <p>
        Ця Політика є юридично обов'язковою угодою між Вами («Користувач», «Ви»
        або «Ваш») та FlumX («FlumX», «ми», «нас» або «наш»). Якщо Ви укладаєте
        цю угоду від імені бізнесу або іншої юридичної особи, Ви підтверджуєте,
        що маєте повноваження зобов'язувати таку юридичну особу укладати цю
        угоду, в такому разі терміни «Користувач», «Ви» або «Ваш» будуть
        відноситись до такої юридичної особи. Якщо у Вас немає такого
        повноваження, або якщо Ви не згодні з умовами цієї угоди, Ви повинні
        відмовитись від її укладання та не мати доступу до Веб-сайту та Послуг.
        За доступ до Веб-сайту та Послуг Ви підтверджуєте, що прочитали,
        зрозуміли і погоджуєтеся з умовами цієї Політики. Ця Політика не
        застосовується до практик компаній, якими ми не володіємо або не
        контролюємо, або до осіб, якими ми не керуємо або не займаємо.
      </p>
      <div></div>
      <h2 id="automatic-collection-of-information">
        Автоматичний збір інформації
      </h2>
      <p>
        Коли Ви відкриваєте Веб-сайт, наші сервери автоматично записують
        інформацію, яку Ваш браузер надсилає. Ці дані можуть включати
        інформацію, таку як IP-адреса Вашого пристрою, тип та версія браузера,
        тип та версія операційної системи, мовні налаштування або веб-сторінку,
        яку Ви відвідали перед тим, як перейшли на Веб-сайт та Послуги, сторінки
        Веб-сайту та Послуг, які Ви відвідали, час, проведений на цих сторінках,
        інформацію, яку Ви шукаєте на Веб-сайті, час та дати доступу та іншу
        статистику.
      </p>
      <p>
        Інформація, яка збирається автоматично, використовується лише для
        виявлення можливих випадків зловживання та встановлення статистичної
        інформації щодо використання та трафіку Веб-сайту та Послуг. Ця
        статистична інформація не агрегується таким чином, щоб ідентифікувати
        будь-якого окремого користувача системи.
      </p>
      <h2 id="collection-of-personal-information">Збір особистої інформації</h2>
      <p>
        Ви можете отримати доступ до Веб-сайту та Послуг і використовувати їх,
        не повідомляючи нам, хто ви є, або не розкриваючи будь-яку інформацію,
        за якою можна було б ідентифікувати вас як конкретну особу. Однак, якщо
        ви бажаєте використовувати деякі функції, запропоновані на Веб-сайті,
        вас можуть попросити надати певну особисту інформацію (наприклад, ваше
        ім'я та адресу електронної пошти).
      </p>
      <p>
        Ми отримуємо та зберігаємо будь-яку інформацію, яку ви свідомо надаєте
        нам під час створення облікового запису або заповнення будь-яких форм на
        Веб-сайті. При необхідності ця інформація може включати наступне:
      </p>
      <ul>
        <li>
          Деталі облікового запису (такі як ім'я користувача, унікальний
          ідентифікатор користувача, пароль тощо)
        </li>
        <li>
          Контактна інформація (така як адреса електронної пошти, номер телефону
          тощо)
        </li>
        <li>
          Основна особиста інформація (така як ім'я, країна проживання тощо)
        </li>
        <li>
          Чутлива особиста інформація (така як етнічна приналежність, релігійні
          переконання, стан здоров'я тощо)
        </li>
        <li>Геодані вашого пристрою (такі як широта та довгота)</li>
        <li>
          Будь-які інші матеріали, які ви надаєте нам добровільно (такі як
          статті, зображення, відгуки тощо)
        </li>
      </ul>
      <p>
        Ви можете вибрати не надавати нам свої персональні дані, але тоді ви не
        зможете скористатися деякими можливостями на веб-сайті. Користувачі, які
        не впевнені, які інформації є обов'язковими, можуть звернутися до нас за
        допомогою контактної інформації на веб-сайті.
      </p>
      <h2 id="privacy-of-children">Конфіденційність дітей</h2>
      <p>
        Ми не намагаємось свідомо збирати жодної персональної інформації від
        дітей віком до 13 років. Якщо ви є особою, яка не досягла 13-річного
        віку, будь ласка, не передавайте жодної персональної інформації через
        Веб-сайт та Послуги. Якщо у вас є підстави вважати, що дитина віком до
        13 років надала нам персональну інформацію через Веб-сайт та Послуги,
        будь ласка, зв'яжіться з нами, щоб запросити видалення персональної
        інформації цієї дитини з наших Послуг.
      </p>
      <p>
        Ми закликаємо батьків та законних опікунів відстежувати
        Інтернет-використання своїх дітей і допомагати здійснювати цю Політику,
        вказуючи своїм дітям ніколи не надавати персональну інформацію через
        Веб-сайт і послуги без їх дозволу. Також ми просимо всіх батьків і
        законних опікунів, які доглядають за дітьми, вживати необхідних заходів,
        щоб гарантувати, що їхні діти будуть інструктовані ніколи не виходити за
        межі своєї особистої інформації, коли вонлайн без їхнього дозволу.
      </p>
      <h2 id="using-and-collection-information">Використання та обробка зібраної інформації</h2>
      <p>
        Ми виступаємо як контролер і обробник персональних даних, якщо з вами не
        укладено угоду щодо обробки даних, в такому випадку ви виступаєте як
        контролер даних, а ми - як обробник даних.
      </p>
      <p>
        Наша роль може відрізнятися в залежності від конкретної ситуації, що
        стосується персональної інформації. Ми діємо в якості контролера даних,
        коли просимо вас надіслати вашу персональну інформацію, яка необхідна
        для забезпечення вашого доступу та використання Веб-сайту та Послуг. У
        таких випадках ми є контролером даних, оскільки ми визначаємо цілі та
        засоби обробки персональної інформації.
      </p>
      <p>
        Ми діємо в якості обробника даних у випадках, коли ви надсилаєте
        персональну інформацію через веб-сайт та сервіси. Ми не є власником,
        контролером або приймачем рішень щодо наданої персональної інформації, і
        така персональна інформація обробляється лише відповідно до ваших
        інструкцій. У таких випадках користувач, що надає персональну
        інформацію, діє як контролер даних.
      </p>
      <p>
        Для забезпечення доступу до Веб-сайту та надання послуг ми можемо
        потребувати зібрати та використовувати деяку особисту інформацію. Якщо
        ви не надасте запитану інформацію, ми можемо бути не у стані надати вам
        запитані продукти чи послуги. Будь-яка зібрана від вас інформація може
        використовуватись для наступних цілей:
      </p>
      <ul>
        <li>Створення та управління обліковими записами користувачів</li>
        <li>Відповідь на запити та надання підтримки</li>
        <li>Запит відгуків користувачів</li>
        <li>Захист від зловживань та зловживальників</li>
        <li>Робота та експлуатація веб-сайту та послуг</li>
      </ul>
      <p>
        Обробка вашої особистої інформації залежить від того, як ви взаємодієте
        з веб-сайтом та послугами, де ви знаходитесь у світі та чи стосується
        одна з наступних умов: (i) ви дали свою згоду на один або кілька
        конкретних цілей; (ii) надання інформації необхідне для виконання
        договору з вами та / або для виконання переддоговірних зобов'язань;
        (iii) обробка необхідна для виконання правового обов'язку, якому ви
        підпорядковуєтеся; (iv) обробка пов'язана з завданням, що виконується в
        інтересах громадської діяльності або в межах повноважень, наданих нам у
        виконанні службових обов'язків; (v) обробка необхідна для здійснення
        законних інтересів нашої компанії або третьої сторони. Ми також можемо
        комбінувати або агрегувати деяку вашу особисту інформацію, щоб краще
        обслуговувати вас та покращувати наш веб-сайт та послуги.
      </p>
      <p>
        Зверніть увагу, що за деяких законодавств ми можемо мати право обробляти
        інформацію до того моменту, поки ви не заперечите проти такої обробки
        шляхом відмови, не залежно від того, чи ми маємо згоду, чи будь-яку іншу
        правову підставу. У будь-якому випадку, ми будемо раді уточнити
        конкретну правову підставу, яка застосовується до обробки, зокрема, чи є
        надання персональної інформації законним або контрактним вимогами, або
        вимогою, необхідною для укладення договору.
      </p>
      <h2 id="managing-information">Управління інформацією</h2>
      <p>
        Ви можете видалити деяку особисту інформацію, яку ми маємо про вас. Тип
        особистої інформації, яку можна видалити, може змінюватись залежно від
        змін на веб-сайті та сервісах. Однак, коли ви видаляєте особисту
        інформацію, ми можемо зберігати копію не переробленої особистої
        інформації в наших записах протягом терміну, необхідного для виконання
        наших зобов'язань перед нашими афіліатами та партнерами та для цілей,
        описаних нижче. Якщо ви хочете видалити свою особисту інформацію або
        назавжди видалити свій обліковий запис, ви можете зробити це на сторінці
        налаштувань свого облікового запису на веб-сайті.
      </p>
      <h2 id="disclosure-of-information">Розкриття інформації</h2>
      <p>
        Залежно від запитуваних послуг або у разі необхідності завершення
        будь-якої транзакції чи надання будь-яких послуг, які ви запитали, ми
        можемо ділитись вашою інформацією з нашими афілійованими компаніями,
        договірними компаніями та постачальниками послуг (узагальнено,
        "Постачальники послуг"), на яких ми покладаємось, щоб допомогти у роботі
        веб-сайту та послуг, доступних вам, і чиї політики конфіденційності
        відповідають нашим або хто згодні дотримуватися наших політик щодо
        персональної інформації. Ми не будемо ділитись жодною особисто
        ідентифікованою інформацією з третіми сторонами і не будемо передавати
        будь-яку інформацію третім незалежним сторонам.
      </p>
      <p>
        Постачальники послуг не мають права використовувати або розкривати вашу
        інформацію, крім необхідних для виконання послуг від нашого імені або
        відповідно до юридичних вимог. Постачальникам послуг надається
        інформація, яку вони потребують лише для виконання їх призначених
        функцій, і ми не дозволяємо їм використовувати або розкривати будь-яку
        надану інформацію для власних маркетингових або інших цілей.
      </p>
      <h2 id="retention-of-information">Зберігання інформації</h2>
      <p>
        Ми зберігатимемо та використовуватимо вашу особисту інформацію протягом
        необхідного періоду, поки ваш обліковий запис користувача залишається
        активним, для забезпечення виконання наших угод, вирішення спорів та,
        якщо це необхідно або дозволено законом, протягом більш тривалого
        періоду зберігання.
      </p>
      <p>
        Ми можемо використовувати будь-які узагальнені дані, що випливають з
        вашої персональної інформації, після її оновлення або видалення, але не
        таким чином, що може ідентифікувати вас особисто. Після закінчення
        строку зберігання, персональна інформація буде видалена. Тому право на
        доступ, право на видалення, право на виправлення та право на перенесення
        даних не можуть бути здійснені після закінчення строку зберігання.
      </p>
      <h2 id="do-not-track-signals">Сигнали про НЕ відстеження</h2>
      <p>
        Деякі браузери включають функцію "Не відстежувати", яка сигналізує
        відвідуваним вами веб-сайтам, що ви не бажаєте, щоб ваша
        онлайн-активність відстежувалася. Відстеження не є тим же самим, що збір
        або використання інформації у зв'язку з веб-сайтом. У цьому контексті
        відстеження означає збір персонально ідентифікованої інформації від
        споживачів, які використовують або відвідують веб-сайт чи онлайн-сервіс,
        переходячи з одного веб-сайту на інший протягом часу. Те, як браузери
        комунікують сигнали "Не відстежувати", ще не є єдним. Тому веб-сайт і
        сервіси ще не налаштовані для інтерпретації чи відповіді на сигнали "Не
        відстежувати", що передаються вашим браузером. Проте, як описано
        докладніше у цій Політиці, ми обмежуємо використання та збір вашої
        персональної інформації. Для отримання опису протоколів "Не
        відстежувати" для браузерів та мобільних пристроїв або дізнатися більше
        про доступні вам варіанти відвідайте.
        <a
          href="https://www.internetcookies.com"
          target="_blank"
          ref="nofollow noreferrer noopener external"
          >internetcookies.com</a
        >
      </p>
      <h2 id="social-media-features">Функції соціальних мереж</h2>
      <p>
        Наш веб-сайт та сервіс можуть містити функції соціальних мереж, такі як
        кнопки Facebook та Twitter, кнопки Share This та інші (загалом, "Функції
        соціальних мереж"). Ці Функції соціальних мереж можуть збирати ваш
        IP-адресу, інформацію про ту сторінку, яку ви відвідуєте на нашому
        веб-сайті та сервісі, і можуть встановлювати файли cookie, щоб Функції
        соціальних мереж працювали належним чином. Функції соціальних мереж
        розміщуються або провайдерами соціальних мереж, або безпосередньо на
        нашому веб-сайті та сервісі. Ваші взаємодії з цими Функціями соціальних
        мереж контролюються політикою конфіденційності їх провайдерів.
      </p>
      <h2 id="links-to-other-resources">Посилання на інші ресурси</h2>
      <p>
        Веб-сайт та сервіси містять посилання на інші ресурси, які не належать
        або не контролюються нами. Будь ласка, зверніть увагу, що ми не несемо
        відповідальності за практики конфіденційності таких інших ресурсів або
        третіх сторін. Ми радимо вам бути обачними, коли залишаєте веб-сайт та
        сервіси та читати заяви про конфіденційність кожного ресурсу, який може
        збирати особисту інформацію.
      </p>
      <h2 id="information-security">Інформаційна безпека</h2>
      <p>
        Жоден передача даних через Інтернет або бездротову мережу не може бути
        гарантованим. Тому, хоча ми і намагаємося захистити вашу особисту
        інформацію, ви визнаєте, що (і) існують обмеження безпеки та приватності
        Інтернету, які перебувають поза нашим контролем; (іі) безпека,
        цілісність та приватність будь-якої інформації та даних, які обмінюються
        між вами та веб-сайтом та сервісами, не можуть бути гарантовані; і (ііі)
        така інформація та дані можуть бути переглянуті або підроблені в дорозі
        третьою стороною, незважаючи на найкращі зусилля.
      </p>
      <p>
        Як безпека персональної інформації залежить частково від безпеки
        пристрою, яким ви використовуєте для зв'язку з нами та від захисту своїх
        облікових даних, будь ласка, вживайте належних заходів для захисту цієї
        інформації.
      </p>
      <h2 id="data-breach">Порушення захисту даних</h2>
      <p>
        У разі, якщо ми дізнаємося, що безпека Веб-сайту та Сервісу була
        порушена або особиста інформація користувачів була розкрита третім
        сторонам внаслідок зовнішньої діяльності, включаючи, але не обмежуючись,
        кібератаки або шахрайство, ми залишаємо за собою право прийняти належні
        заходи, включаючи, але не обмежуючись, розслідування та звітність, а
        також повідомлення та співпрацю з правоохоронними органами. У разі
        порушення безпеки даних ми зробимо розумні зусилля для повідомлення
        потерпілих осіб, якщо ми вважаємо, що існує реальний ризик шкоди
        користувачеві в результаті порушення або якщо повідомлення вимагається
        законом. Коли це станеться, ми відправимо вам електронний лист або
        зв'яжемось з вами за допомогою телефону.
      </p>
      <h2 id="changes-and-amendments">Зміни та поправки</h2>
      <p>
        Ми залишаємо за собою право змінювати цю Політику або її умови,
        пов'язані з Веб-сайтом та Послугами, в будь-який час за нашою власною
        усудом. Коли ми це робимо, ми відновлюємо дату оновлення внизу цієї
        сторінки. Ми також можемо повідомляти вас іншими способами за нашою
        усудом, наприклад, через контактну інформацію, яку ви надали.
      </p>
      <p>
        Оновлена версія цієї Політики буде негайно діяти після публікації
        переробленої Політики, якщо інше не передбачено. Ваше подальше
        використання Веб-сайту та Послуг після дати введення в дію переробленої
        Політики (або таких інших дій, вказаних на той час), буде означати вашу
        згоду з цими змінами. Однак ми не будемо без вашої згоди використовувати
        вашу Особисту Інформацію інакше, ніж було заявлено на момент її збору.
      </p>
      <h2 id="acceptance-of-this-policy">Прийняття цієї політики</h2>
      <p>
        Ви визнаєте, що прочитали цю Політику та згодні з усіма її
        умовами. Звернувшись до використання Веб-сайту та Послуг та надіславши
        свою інформацію, ви погоджуєтеся бути зв'язаними цією Політикою. Якщо ви
        не погоджуєтеся дотримуватися умов цієї Політики, ви не маєте права
        отримувати доступ до Веб-сайту та Послуг.
      </p>
      <h2 id="contacting-us">Зв'язок з нами</h2>
      <p>
        Якщо у вас є будь-які питання, турботи або скарги щодо цієї Політики,
        інформації, яку ми зберігаємо про вас, або якщо ви хочете скористатися
        своїми правами, ми радимо вам зв'язатися з нами за допомогою наступних
        контактних даних:
      </p>
      <p>
        <a
          href="&#109;&#097;&#105;&#108;&#116;&#111;&#058;b&#108;anb&#97;&#108;l.c&#108;&#105;&#101;n&#116;&#64;i&#116;&#45;f&#108;u&#109;x.&#99;o&#109;"
          >&#98;&#108;a&#110;&#98;a&#108;l.c&#108;i&#101;n&#116;&#64;it&#45;fl&#117;mx&#46;c&#111;&#109;</a
        >
      </p>
      <p>
        Ми намагатимемося вирішувати скарги та конфлікти та робитимемо зусилля,
        щоб виконати вашe бажання щодо вправ відповідно до вимог чинного
        законодавства з охорони даних якомога швидше та в будь-якому випадку, в
        межах строків, передбачених чинними законами з охорони даних.
      </p>
      <p>Цей документ був оновлений останній раз 13 квітня 2023 року.</p>
    </template>
  </PolicyWrapper>
</template>

<script>
 

import PolicyWrapper from '@mainComponents/policy/PolicyWrapper.vue';

import { CONSTS } from '@consts'

export default {
  components: {
    PolicyWrapper,
  },
  setup() {
    const contentItems = computed(() => {
      return CONSTS.policy.PRIVACY_POLICY_ITEMS
    });

    return {
      contentItems,
    };
  },
};
</script>

<style lang="scss" scoped>
@import '@sytles/policy.scss';
</style>
