export default {
  change_number: {
    'title': 'Зміна номера телефону',
    'main-text': 'Тут Ви можете змінити номер телефону. Ваш акаунт і всі наявні дані будут перенесені на новий номер без втрати поточних налаштувань та інформації.',
    'leave-email': 'Залишити поточний номер',
    'change-number-title': 'Змінити номер',
    'current-number': 'Поточний номер',
    'new-number': 'Новий номер',
    'sms-code': 'SMS із кодом підтвердження прийде протягом 30 сек'
  },
  change_login: {
    'title': 'Зміна логіну облікового запису',
    'current-email': 'Поточний E-mail',
    'new-email': 'Новий E-mail'
  }
}